
// 1.  Ви прийшли в Макдональдз з трьома друзями.
//     Всі вони хочуть зʼїсти гамбургер. Ви хочете зʼїсти гамбургер з картоплею.
//     Реалізувати код, який буде перевіряти, що якщо всім вистачає гамбургерів і картоплі,
//     то виводити текст "Ми поїли" в консоль. Якщо на всіх не вистачає їжі,
//     то виводити в консоль текст "Ми йдемо в інше кафе"
//     (Змінні типу інтеджер містять кількість продуктів в наявності у вигляді вхідних даних)
let hamburgers = 3;
let fries = 5;

if (hamburgers >= 3 && fries >= 3){
    console.log("Ми поїли")
}
else {
    console.log("Ми йдемо в інше кафе")
}
// 2.  Напишіть умовну конструкцію if, що перевіряє, чи знаходиться значення ціни товару між 1000 та 1900 включно.
//     Результат виводити в консоль.
let price = 1500;

if (price >= 1000 && price <= 1900) {
  console.log("Ціна знаходиться між 1000 та 1900")
}
// 3.  Напишіть конструкцію if, щоб перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
//     Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
//     Результат виводити в консоль.
let price1 = 1500;
if (price1 >= 1000 && price1 <= 1900){
console.log("Ціна знаходиться між 1000 та 1900")
}
if (price1 < 1000 || price1 > 1900){
 console.log("Ціна не знаходиться між 1000 та 1900")
}
// 4.  За номером пори року вивести назву цієї пори року використовуючи оператор if-else-if
//     Результат виводити в консоль.
let season = 10;

if (season == 1) {
    console.log('Зима');
} else if (season == 2) {
    console.log('Весна');
} else if (season == 3) {
    console.log('Літо');
} else if (season == 4) {
    console.log('Осінь');
} else {
    console.log('Error');
}
// 5.  Задано 3 числа (a, b, c), які не рівні між собою.
//     Визначити середнє мід цими трьома числами
//     (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
//     Використати вкладені оператори if
//     Результат виводити в консоль.
let a = 10;
let b = 11;
let c = 12;

if ( a > b && a > c){
 if (b>c) {
  console.log(c)
}
 } else {
  if ( a > b && a < c){
    console.log(a)
  } else {
    console.log(b)
  }
 }
//  6.  Задано номер дня тижня.
//  За заданим номером вивести назву дня тижня використовуючи switch.
//  Результат виводити в консоль.
let day = '7';

switch (day) {
  case '1':
    console.log('Monday');
    break;
  case '2':
    console.log('Tuesday');
    break;
  case '3':
    console.log('Wednesday');
    break;
  case '4':
    console.log('Thursday');
    break;
  case '5':
    console.log('Friday');
    break;
  case '6':
    console.log('Saturday');
    break;
  case '7':
    console.log('Sunday');
    break;
  default:
    console.log('Invalid day');
}

// 7.  За допомогою switch реалізуйте обчислення виразу, передаючи у switch, як параметр, символ математичної операції.
//     Математичні операції для обчислення: "+", "-", "*", "/".
//     Результат виводити в консоль.
a = 10
b = 5
result = '*'

switch (result) {
  case '+':
    console.log(a + b);
    break;
  case '-':
    console.log(a - b);
    break;
  case '*':
    console.log(a * b);
    break;
  case '/':
    console.log(a / b);
    break;
  default:
    console.log('Error');
}

// 8.*  Використовуючи властивості рядків (тип string), та регулярний вираз (regular expression) видалити голосні букви зі слова.



// 9. Використовуючи оператор if реалізувати логіку переводу метрів в кілометри,
// так щоб в консоль виводився результат обчислень з правильним закінченням.
// Наприклад: 1000 метрів це 1 кілометр;  32 метри це 0,032 кілометра і т.д.
meters = 1000

if (meters >= 1000){
  km = meters / 1000
  console.log(meters + ' метрів це ' + km + ' кілометр')}
else{
  km = meters / 1000
  console.log(meters + ' метри це ' + km + ' кілометр')
}